<?php
return [
    1=>[
        [
            'name' => '元日',
            'day' => 1,
        ],
        [
            'name' => '成人の日',
            'week' => 2,
            'wday' => 1,

        ],
    ],
    2 => [
        [
            'name' => '建国記念の日',
            'day' => 11,
            'since' => '1966-5-1', # ???
        ],
        [
            'name' => '天皇誕生日', # 令和天皇
            'day' => 23,
            'since' => 2018,
        ],
    ],
    3 => [
        [
            'name' => '春分の日',
            'func' => 'vernalEquinox',
        ],
    ],
    4 => [
        [
            'name' => '昭和の日',
            'day' => 29,
        ],
        [
            'name' => '天皇誕生日', # 昭和天皇
            'day' => 29,
            'since' => 1910,
            'until' => 1988,
        ],
    ],
    5 => [
        [
            'name' => '憲法記念日',
            'day' => 3,
        ],
        [
            'name' => 'みどりの日',
            'day' => 4,
        ],
        [
            'name' => 'こどもの日',
            'day' => 5,
        ],
             
    ],
    7 => [
        [
            'name' => '海の日',
            'week' => 3,
            'wday' => 1,
            'except' => [2020,2021],
        ],
        [
            'name' => '海の日',
            'day' => 22,
            'year' => 2021
        ],
        [
            'name' => '海の日',
            'day' => 23,
            'year' => 2020,
        ],
        [
            'name' => 'スポーツの日',
            'day' => 24,
            'year' => 2020,
        ],  
        [
            'name' => 'スポーツの日',
            'day' => 23,
            'year' => 2021,
        ],

    ],
    8 => [
        [
            'name' => '山の日',
            'day' => 11,
            'except' => [2020,2021]
        ],
        [
            'name' => '山の日',
            'day' => 8,
            'year' => 2021,
        ],
        [
            'name' => '山の日',
            'day' => 10,
            'year' => 2020,
        ],        
    ],
    9 => [
        [
            'name' => '敬老の日',
            'day' => 18,
        ],
        [
            'name' => '秋分の日',
            'func' => 'autumnalEquinox',
        ], 
    ],
    10 => [
        [
            'name' => 'スポーツの日',
            'day' => 9,
            'except' => [2020,2021]
        ],
    ],
    11 => [
        [
            'name' => '文化の日',
            'day' => 3,
        ],
        [
            'name' => '勤労感謝の日',
            'day' => 23,
        ],
    ],
    12 => [
        [
            'name' => '天皇誕生日', # 平成天皇
            'day' => 23,
            'since' => 1988,
            'until' => 2017,
        ],
    ],
];